
export const defaultValue = {
    項目名: "XX情報",
    内容: [
        {
            項目名: "ID",
            備考: [
                "半角英数字と\n _（アンダーバー）のみ",
                "～～～"]
        },
        {
            項目名: "名前",
            備考: "－"
        },
        {
            項目名: "項目A",
            備考: [
                {
                    "item1": "value1-1",
                    "item2": "value2-1",
                },
                {
                    "item1": "value1-2",
                    "item2": "value2-2",
                }
            ]
        },
        {
            項目名: "項目B",
            備考:
            {
                アイテム1: "値1",
                アイテム2: [
                    {
                        "title1": "aaa",
                        "title2": "bbb",
                    },
                    {
                        "title1":
                            [
                                "～～",
                                "～～"
                            ],
                        "title2": "ccc",
                    }
                ]
            }
        },
    ]
}
export const defaultValue1 = {
    システム名: "XXXシステム",
    コンポーネント: {
        項目名: "顧客情報",
        スコープ: "セッション",
        備考: "認証成功時にセット、ログアウト時にクリア",
        子要素: [
            {
                項目名: "顧客ID",
                データ型: "文字列",
                備考: [
                    "半角英数字と\n _（アンダーバー）のみ許容",
                    "～～～"]
            },
            {
                項目名: "顧客名",
                データ型: "文字列",
                備考: "－"
            },
            {
                項目名: "顧客フリガナ",
                データ型: "文字列",
                備考: "－"
            },
            {
                項目名: "顧客生年月日",
                データ型: "日付",
                備考: "－"
            },
            {
                項目名: "項目A",
                データ型: "文字列",
                備考: [
                    {
                        "item1": "value1-1",
                        "item2": "value2-1",
                    },
                    {
                        "item1": "value1-2",
                        "item2": "value2-2",
                    }
                ]
            },
            {
                項目名: "顧客メールアドレス",
                データ型: "文字列",
                備考: "－"
            },
            {
                項目名: "項目B",
                データ型: "文字列",
                備考:
                {
                    アイテム1: "値1",
                    アイテム2: [
                        {
                            "title1": "aaa",
                            "title2": "bbb",
                        },
                        {
                            "title1":
                                [
                                    "～～",
                                    "～～"
                                ],
                            "title2": "ccc",
                        }
                    ]
                }
            },
        ]
    }
}